
# Змінна для контролю кількості виведених рядків (наразі не імплементовано)
lines = 0

# Константи для курсору в консолі.
go_up = "\033[A" # Переміщення на одну позицію символу вгору,
go_dn = "\033[B" # ... вниз,
go_rt = "\033[C" # ... вправо,
go_lf = "\033[D" # ... вліво.
r_cln = "\033[K" # Очищення всього що є після курсору.

def view(s:str, args='', reset=True):
    '''
    *Повертає рядок з кольоровим оформленням і ефектами.*

    ### Комбінованні значення для `args`
    * Можна комбінувати ефект`¹`, колір шрифта`²` і фону`³`.
    * Лише по одному значенню для кожного. Наприклад: `*1d` буде червоний жирний шрифт і жовтий фон.
    * Флаг `reset` означає що після цього тексту форматування буде скинуте до базового.

    **Таблиця підстановки кольорів:**
    |       **Шрифт**       |      **Фон**      |  **Колір**   |
    |:---------------------:|:-----------------:|:------------:|
    |          `0`          |        `a`        | *Чорний*     |
    |          `1`          |        `b`        | *Червоний*   |
    |          `2`          |        `c`        | *Зелений*    |
    |          `3`          |        `d`        | *Жовтий*     |
    |          `4`          |        `e`        | *Синій*      |
    |          `5`          |        `f`        | *Фіолетовий* |
    |          `6`          |        `g`        | *Бірюзовий*  |
    |          `7`          |        `h`        | *Білий*      |

    **Додаткові ефекти:**  
    |    **Символ**      |    **Ефект**     |
    |:------------------:|:----------------:|
    |`*`<br>*(зірочка)*  | **жирний**       |
    |`-`<br>*(дефіс)*    | **підкреслений** |
    |`'`<br>*(апостроф)* | **невидимий**    |
    '''

    # Символи для підстановки кодів
    repl = {
            '0': '30',
            '1': '31',
            '2': '32',
            '3': '33',
            '4': '34',
            '5': '35',
            '6': '36',
            '7': '37',
            'a': '40',
            'b': '41',
            'c': '42',
            'd': '43',
            'e': '44',
            'f': '45',
            'g': '46',
            'h': '47',
            '*': '1',
            '-': '4',
            "'": '8',
                }
    
    # Замінюємо символи за словником та об'єднуємо через ';'
    args = ";".join(repl[ch] for ch in args if ch in repl)
    # print("[" + args + "]", end='')

    # Якщо аргументи форматування присутні, то форматуємо
    result = ''
    if not args == '':
        result += '\033[' + args + 'm'

    result += s

    if reset == True:
        result += '\033[0m' # Скидаємо форматування
    
    return result

def higlight_cmd(s:str) -> str:
    '''Повертає форматовану **команду**'''
    return view(s, '*2')

def person(name:str) -> str:
    '''Повертає форматоване **ім'я** контакту'''
    return view(name, '5')

def phone(number:str) -> str:
    '''Повертає форматований **номер** телефону'''
    return view(number, '6')

def prn(s:str, end=None):
    '''Друкує рядок як з `print`, але додатково контролює кількість надрукованих рядків'''
    print(s, end=end)
    global lines
    lines += s.count("\n") + 1

def lines_clean():
    '''
    Метод для очистки попередніх непотрібних рядків в консолі...

    *Наразі не реалізовано* 🥸
    '''
    return
    # global lines
    # for i in range(lines + 1):
    #     print(go_up + '\r' + r_cln, end='')
    # lines = 0

def clear_screen():
    '''Очищує екран і повертає курсор у лівий верхній кут'''
    print("\033[H\033[J", end='')
    
if __name__ == "__main__":  # тестуємо...
    clear_screen()
    view(" Хеллоу Ворлд! ", '*4h')